art/note/j06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-26 Wed 13:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbfd50d7">1. intro 什么是软件测试</a>
<ul>
<li><a href="#org6ae826f">1.1. 测试的分类</a></li>
<li><a href="#orgd1d2bc8">1.2. 测试用例</a></li>
<li><a href="#orge19bac5">1.3. 测试方法</a></li>
<li><a href="#org512eea9">1.4. 设计原则</a></li>
</ul>
</li>
<li><a href="#org360bf65">2. 白盒测试</a>
<ul>
<li><a href="#orga35721c">2.1. 优缺点</a>
<ul>
<li><a href="#orgac391a5">2.1.1. 优点</a></li>
<li><a href="#org510cff6">2.1.2. 缺点</a></li>
</ul>
</li>
<li><a href="#orgb21ffb9">2.2. 模型</a></li>
<li><a href="#orgc4cbd34">2.3. 逻辑覆盖方法</a></li>
</ul>
</li>
<li><a href="#org74b5d41">3. 黑盒测试</a>
<ul>
<li><a href="#org9f188ef">3.1. 等价类</a></li>
<li><a href="#org7909e3c">3.2. 覆盖等价类</a></li>
<li><a href="#orgfbead56">3.3. 边界值分析</a></li>
<li><a href="#org31c5236">3.4. 场景法</a></li>
<li><a href="#orgc2d8b5b">3.5. 单元测试</a></li>
</ul>
</li>
<li><a href="#orgd90b84d">4. 压力测试和性能测试?</a></li>
<li><a href="#orgd37c86b">5. 代码质量保证?</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbfd50d7" class="outline-2">
<h2 id="orgbfd50d7"><span class="section-number-2">1</span> intro 什么是软件测试</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6ae826f" class="outline-3">
<h3 id="org6ae826f"><span class="section-number-3">1.1</span> 测试的分类</h3>
<div class="outline-text-3" id="text-1-1">
<p>
软件生命周期之中, 将会执行不同类型或者级别的软件测试. 我们应当组合应用
不同类型的测试, 以确保系统功能行为都符合预期.
</p>

<p>
两种分类: 
</p>
<ol class="org-ol">
<li>V模式</li>
<li>W模式</li>
</ol>
<p>
前者就是线性的软件编写和测试, 也就是说, 只有现编写完了, 我们才能够进行
测试. 是一种线性的结构. 
</p>

<p>
W 模式就是测试和编写并行.编写程序的同时, 还编写了应该如何测试. 随后再
进行测试.
</p>
</div>
</div>

<div id="outline-container-orgd1d2bc8" class="outline-3">
<h3 id="orgd1d2bc8"><span class="section-number-3">1.2</span> 测试用例</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Test case 是指对于某个产品进行的 <b>测试任务的描述</b>. 体现测试方案方法计
数和策略 (?)
</p>

<p>
简单地认为, 测试用例是为了一个 <b>特定的目标</b> 而定制的一组 <b>测试输入, 实
行条件和预期结果</b>. Indeed. 用于核实是否满足某种需求.
</p>

<p>
测试用例是执行的 <b>最小测试实体</b>.
</p>
</div>
</div>

<div id="outline-container-orge19bac5" class="outline-3">
<h3 id="orge19bac5"><span class="section-number-3">1.3</span> 测试方法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
测试用例（Test Case）是将 <b>行为活动</b> 做一个科学化的组织归纳，目的是能
够将软件测试的行为转化成可管理的模式；同时测试用例也是将测试具体量化的
方法之一，不同类别的软件，测试用例是不同的。
</p>

<p>
你在说你吗呢.
</p>

<p>
分为白盒测试和黑盒测试. 
</p>

<ul class="org-ul">
<li><b>白盒</b>: 全面了解程序内部逻辑结构.</li>
<li><b>黑盒</b>: 功能测试, 不考虑内部逻辑.</li>
</ul>
</div>
</div>

<div id="outline-container-org512eea9" class="outline-3">
<h3 id="org512eea9"><span class="section-number-3">1.4</span> 设计原则</h3>
</div>
</div>



<div id="outline-container-org360bf65" class="outline-2">
<h2 id="org360bf65"><span class="section-number-2">2</span> 白盒测试</h2>
<div class="outline-text-2" id="text-2">
<p>
也称为 <code>结构测试</code> 和 <code>逻辑驱动</code> 测试, 基于源代码, 对于程序内部展开测试.
其验证程序中的通路是否有正常工作. 
</p>
</div>

<div id="outline-container-orga35721c" class="outline-3">
<h3 id="orga35721c"><span class="section-number-3">2.1</span> 优缺点</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgac391a5" class="outline-4">
<h4 id="orgac391a5"><span class="section-number-4">2.1.1</span> 优点</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
其针对程序内部的各个部分, 因此定位速度快. 有助于了解测试的 <code>覆盖程度</code> ,
有助于优化代码. 
</p>
</div>
</div>

<div id="outline-container-org510cff6" class="outline-4">
<h4 id="org510cff6"><span class="section-number-4">2.1.2</span> 缺点</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
但是其对于测试人员的要求高. 并且成本较高.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb21ffb9" class="outline-3">
<h3 id="orgb21ffb9"><span class="section-number-3">2.2</span> 模型</h3>
<div class="outline-text-3" id="text-2-2">
<p>
白盒测试需要验证所有道路. 于是对于不同分支结构需要进行对应的模型构建. 
</p>
</div>
</div>

<div id="outline-container-orgc4cbd34" class="outline-3">
<h3 id="orgc4cbd34"><span class="section-number-3">2.3</span> 逻辑覆盖方法</h3>
<div class="outline-text-3" id="text-2-3">
<p>
针对不同分支, 其判定表达式, 来遍历整个结构, 也就是每一个分支, 每一个情
况都能测试到, 也即, 实现了对于程序的 <code>覆盖</code> 
</p>

<p>
有下面指标: 
</p>
<ol class="org-ol">
<li>语句覆盖; 程序之中的每一个 <code>语句</code> 都执行了一遍.</li>
<li>判定覆盖: 程序之中的每个 <code>分支</code> 都执行了一遍.</li>
<li>条件覆盖: 程序之中的每一个逻辑判定 <code>条件</code> 的两种可能(真假)都取到了
一遍.</li>
<li>判定条件覆盖: 判定条件覆盖, 即, 同时满足了判定覆盖和条件覆盖.</li>
<li>条件组合覆盖: 在每一个判定节点之中, 所有简单判定条件的所有可能的取
值组合情况至少执行一次. 比如说, 我们有两个判定条件, 我们需要遍历四
种情况, 也就是 TT TF FT FF 这四种. 所有的 <code>组合</code> 都得进行一遍.</li>
<li>路径覆盖: 程序之中每一条可能的 <code>路径</code> 都执行一遍.</li>
</ol>

<p>
什么, 难道 2.3. 不是一样的吗? 
</p>
</div>
</div>
</div>

<div id="outline-container-org74b5d41" class="outline-2">
<h2 id="org74b5d41"><span class="section-number-2">3</span> 黑盒测试</h2>
<div class="outline-text-2" id="text-3">
<p>
也称为功能测试或者是数据驱动测试, 仅仅对程序接口进行测试. 
</p>

<p>
<b>优点</b> 简单. 开发和测试可以 <code>并行</code>. <b>缺点</b>: 
</p>
</div>

<div id="outline-container-org9f188ef" class="outline-3">
<h3 id="org9f188ef"><span class="section-number-3">3.1</span> 等价类</h3>
<div class="outline-text-3" id="text-3-1">
<p>
一个等价类之中发生的错误是等效的. 我们应当划分出等价类, 随后取等价类之
中的一个例子进行测试. 
</p>

<p>
对于输入, 符合要求的称为有效等价类, 不符合要求的称为无效等价类. 比如说
我们的输入应该为一个数字, 那么有两个等价类, 一个有效的: 确实是数字; 一
个无效的: 含有非数字字符的输入. 
</p>

<p>
比如说, 我们现在输入一个年月, 用 6 位数字表示: 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">年月</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">类型</td>
<td class="org-left">有效</td>
<td class="org-left">无效</td>
</tr>

<tr>
<td class="org-left">6 位数字</td>
<td class="org-left">6 位数字</td>
<td class="org-left">有非数字字符; 多于六个; 少于六个</td>
</tr>

<tr>
<td class="org-left">年份范围</td>
<td class="org-left">范围</td>
<td class="org-left">大于这个范围的; 小于这个范围的</td>
</tr>

<tr>
<td class="org-left">月份范围</td>
<td class="org-left">01到12</td>
<td class="org-left">等于00; 大于12</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7909e3c" class="outline-3">
<h3 id="org7909e3c"><span class="section-number-3">3.2</span> 覆盖等价类</h3>
<div class="outline-text-3" id="text-3-2">
<p>
每一个等价类我们都至少设置一个测试用例. 最好这些用例没有重叠, 也就是说,对
于一个测试用例, 其不会同时是两种等价类.
</p>
</div>
</div>

<div id="outline-container-orgfbead56" class="outline-3">
<h3 id="orgfbead56"><span class="section-number-3">3.3</span> 边界值分析</h3>
<div class="outline-text-3" id="text-3-3">
<p>
边界值分析是一种常用的测试技术, 其选择 <code>系统边界</code> 或者是 <code>边界附近</code> 的
数据进行用例的设计, 这是因为边界条件的测试用例具有更高的测试回报. 
</p>

<p>
针对输入条件的边界点, 进行一个组合就能找到系统的边界. 而输入条件的边界
定义为: 在等价类之中, 可能导致系统的 <code>内部处理机制</code> 发生变化的点. 
</p>

<p>
找到了边界之后, 我们可以进行测试的设计, 这里存在不同的设计, 比如说我们
对于所有边界进行测试, 也就是遍历所有边界值(边界附近的值). 或者是我们考
虑有效等价类之中的边界值. 或者说我们只进行 <code>单边界</code> 的测试, 也就是, 这
个边界值仅仅在 一个条件 的附近. 或者是我们相反, 进行 <code>双边界</code> 的测试.
</p>

<p>
我们能够看到, 双边界测试明显是数据量最小的, 但是其覆盖率并不高. 遍历虽
然说将所有情况都覆盖了, 但是数量庞大, 效率并不是很高. 
</p>
</div>
</div>

<div id="outline-container-org31c5236" class="outline-3">
<h3 id="org31c5236"><span class="section-number-3">3.4</span> 场景法</h3>
<div class="outline-text-3" id="text-3-4">
<p>
以 <code>事件流</code> 为核心, 测试软件, 系统, 程序的 <code>主要业务流程</code>, <code>主要功能的
正确性</code> 和 <code>异常处理能力</code>.
</p>

<p>
这个时候我们针对的不同流程, 看其在某些特定流程之下是否正常运转. 
</p>

<p>
我们流程为: 
</p>
<ol class="org-ol">
<li>定义 <code>基本流</code> 和 <code>备选流</code></li>
<li>定义场景 ?</li>
<li>从场景设计之中测试用例.</li>
<li>输入测试数据, 完善测试用例.</li>
</ol>

<p>
什么几把
</p>
</div>
</div>

<div id="outline-container-orgc2d8b5b" class="outline-3">
<h3 id="orgc2d8b5b"><span class="section-number-3">3.5</span> 单元测试</h3>
<div class="outline-text-3" id="text-3-5">
<p>
针对软件之中的 <code>最小可测试单元</code>, 比如说一个对象之类的, 进行检查和验证,
比如说测试一个对象内部的方法. 单元测试可以看为是编码工作的一部分. 应该
由程序员完成. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgd90b84d" class="outline-2">
<h2 id="orgd90b84d"><span class="section-number-2">4</span> 压力测试和性能测试?</h2>
</div>
<div id="outline-container-orgd37c86b" class="outline-2">
<h2 id="orgd37c86b"><span class="section-number-2">5</span> 代码质量保证?</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-26 Wed 13:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>